reddit_p/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "kaiter"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username,password)
        @user = User.find_by(username: username)

SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
    def generate_session_token
        token = SecureRandom::urlsafe_base64
        while User.exists?(session_token: token)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-02-24 19:04:46.397884"], ["id", 2]]
---
    def reset_session_token!
        self.session_token = generate_session_token
        self.save!