reddit_p/app/controllers/users_controller.rb

    def update
        @user = User.find(params[:id])
        if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Yong Lin"], ["updated_at", "2023-02-24 19:09:06.421056"], ["id", 1]]